hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/*
 * ASID (RW)
 *
 * ASID holds the address space identifier.
 */
#define CSR_SATP_ASID_MASK (0x7FC00000UL)
#define CSR_SATP_ASID_SHIFT (22U)
#define CSR_SATP_ASID_SET(x) (((uint32_t)(x) << CSR_SATP_ASID_SHIFT) & CSR_SATP_ASID_MASK)
#define CSR_SATP_ASID_GET(x) (((uint32_t)(x) & CSR_SATP_ASID_MASK) >> CSR_SATP_ASID_SHIFT)

/*
 * PPN (RW)
 *
 * PPN holds the physical page number of the root page table.
 */
#define CSR_SATP_PPN_MASK (0x3FFFFFUL)
#define CSR_SATP_PPN_SHIFT (0U)
#define CSR_SATP_PPN_SET(x) (((uint32_t)(x) << CSR_SATP_PPN_SHIFT) & CSR_SATP_PPN_MASK)
#define CSR_SATP_PPN_GET(x) (((uint32_t)(x) & CSR_SATP_PPN_MASK) >> CSR_SATP_PPN_SHIFT)

/* Bitfield definition for register: MSTATUS */
/*
 * SD (RO)
 *
 * SD summarizes whether either the FS field or XS field is dirty.
 */
#define CSR_MSTATUS_SD_MASK (0x80000000UL)
#define CSR_MSTATUS_SD_SHIFT (31U)
#define CSR_MSTATUS_SD_GET(x) (((uint32_t)(x) & CSR_MSTATUS_SD_MASK) >> CSR_MSTATUS_SD_SHIFT)

/*
 * TSR (RW)
 *
 * TSR controls whether executing SRET instructions in S-mode will raise illegal instruction exceptions. It is hardwired to 0 when S-mode is not supported.
 * 0: Normal execution
 * 1: Raising exceptions
 */
#define CSR_MSTATUS_TSR_MASK (0x400000UL)
#define CSR_MSTATUS_TSR_SHIFT (22U)
#define CSR_MSTATUS_TSR_SET(x) (((uint32_t)(x) << CSR_MSTATUS_TSR_SHIFT) & CSR_MSTATUS_TSR_MASK)
#define CSR_MSTATUS_TSR_GET(x) (((uint32_t)(x) & CSR_MSTATUS_TSR_MASK) >> CSR_MSTATUS_TSR_SHIFT)

/*
 * TW (RW)
 *
 * TW controls whether executing WFI instructions in S-mode will raise illegal instruction exceptions. It is hardwired to 0 when S-mode is not supported.
 * 0: Normal execution
 * 1: Raising exceptions
 */
#define CSR_MSTATUS_TW_MASK (0x200000UL)
#define CSR_MSTATUS_TW_SHIFT (21U)
#define CSR_MSTATUS_TW_SET(x) (((uint32_t)(x) << CSR_MSTATUS_TW_SHIFT) & CSR_MSTATUS_TW_MASK)
#define CSR_MSTATUS_TW_GET(x) (((uint32_t)(x) & CSR_MSTATUS_TW_MASK) >> CSR_MSTATUS_TW_SHIFT)

/*
 * TVM (RW)
 *
 * TVM controls whether performing certain virtual memory operations in S-mode will raise illegal instruction exceptions. The operations include accessing the satp register and executing the SFENCE.VMA instruction. It is hardwired to 0 when S-mode is not supported.
 * 0:Normal execution
 * 1:Raising exceptions
 */
#define CSR_MSTATUS_TVM_MASK (0x100000UL)
#define CSR_MSTATUS_TVM_SHIFT (20U)
#define CSR_MSTATUS_TVM_SET(x) (((uint32_t)(x) << CSR_MSTATUS_TVM_SHIFT) & CSR_MSTATUS_TVM_MASK)
#define CSR_MSTATUS_TVM_GET(x) (((uint32_t)(x) & CSR_MSTATUS_TVM_MASK) >> CSR_MSTATUS_TVM_SHIFT)

/*
 * MXR (RW)
 *
 * MXR controls whether execute-only pages are readable. It has no effect when page-based virtual memory is not in effect
 * 0:Execute-only pages are not readable
 * 1:Execute-only pages are readable
 */
#define CSR_MSTATUS_MXR_MASK (0x80000UL)
#define CSR_MSTATUS_MXR_SHIFT (19U)
#define CSR_MSTATUS_MXR_SET(x) (((uint32_t)(x) << CSR_MSTATUS_MXR_SHIFT) & CSR_MSTATUS_MXR_MASK)
#define CSR_MSTATUS_MXR_GET(x) (((uint32_t)(x) & CSR_MSTATUS_MXR_MASK) >> CSR_MSTATUS_MXR_SHIFT)

/*
 * SUM (RW)
 *
 * SUM controls whether a S-mode load/store instruction to a user accessible page is allowed or not when page translation is enabled. It is in effect in two scenarios: (a) M-mode with MPRV=1 and MPP=S, and (b) in S-mode. It has no effect when page-based virtual memory is not in effect. A page is user accessible when the U bit of the corresponding PTE entry is 1. It is hardwired to 0 when S-mode is not supported.
 * 0:Not Allowed
 * 1:Allowed
 */
#define CSR_MSTATUS_SUM_MASK (0x40000UL)
#define CSR_MSTATUS_SUM_SHIFT (18U)
#define CSR_MSTATUS_SUM_SET(x) (((uint32_t)(x) << CSR_MSTATUS_SUM_SHIFT) & CSR_MSTATUS_SUM_MASK)
#define CSR_MSTATUS_SUM_GET(x) (((uint32_t)(x) & CSR_MSTATUS_SUM_MASK) >> CSR_MSTATUS_SUM_SHIFT)

/*
 * MPRV (RW)
 *
 * When the MPRV bit is set, the memory access privilege for load and store are specified by the MPP field. When U-mode is not available, this field is hardwired to 0.
 */
#define CSR_MSTATUS_MPRV_MASK (0x20000UL)
#define CSR_MSTATUS_MPRV_SHIFT (17U)
#define CSR_MSTATUS_MPRV_SET(x) (((uint32_t)(x) << CSR_MSTATUS_MPRV_SHIFT) & CSR_MSTATUS_MPRV_MASK)
#define CSR_MSTATUS_MPRV_GET(x) (((uint32_t)(x) & CSR_MSTATUS_MPRV_MASK) >> CSR_MSTATUS_MPRV_SHIFT)

/*
 * XS (RO)
 *
 * XS holds the status of the architectural states (ACE registers) of ACE instructions. The value of this field is zero if ACE extension is not configured. This field is primarily managed by software. The processor hardware assists the state managements in two regards:
 * Illegal instruction exceptions are triggered when XS is Off.
 * XS is updated to the Dirty state with the execution of ACE instructions when XS is not Off. Changing the setting of this field has no effect on the contents of ACE states. In particular, setting XS to Off does not destroy the states, nor does setting XS to Initial clear the contents.
 * 0:Off
 * 1:Initial
 * 2:Clean
 * 3:Dirty
 */
#define CSR_MSTATUS_XS_MASK (0x18000UL)
#define CSR_MSTATUS_XS_SHIFT (15U)
#define CSR_MSTATUS_XS_GET(x) (((uint32_t)(x) & CSR_MSTATUS_XS_MASK) >> CSR_MSTATUS_XS_SHIFT)

/*
 * FS (RW)
 *
 * FS holds the status of the architectural states of the floating-point unit, including the fcsr CSR and f0 – f31 floating-point data registers. The value of this field is zero and read-only if the processor does not have FPU. This field is primarily managed by software. The processor hardware assists the state
 * managements in two regards:
 * Attempts to access fcsr or any f register raise an illegal-instruction exception when FS is Off.
 * FS is updated to the Dirty state with the execution of any instruction that updates fcsr or any f register when FS is Initial or Clean. Changing the setting of this field has no effect on the contents of the floating-point register states. In particular, setting FS to Off does not destroy the states, nor does setting FS to Initial clear the contents.
 * 0:Off
 * 1:Initial
 * 2:Clean
 * 3:Dirty
 */
#define CSR_MSTATUS_FS_MASK (0x6000U)
#define CSR_MSTATUS_FS_SHIFT (13U)
#define CSR_MSTATUS_FS_SET(x) (((uint32_t)(x) << CSR_MSTATUS_FS_SHIFT) & CSR_MSTATUS_FS_MASK)
#define CSR_MSTATUS_FS_GET(x) (((uint32_t)(x) & CSR_MSTATUS_FS_MASK) >> CSR_MSTATUS_FS_SHIFT)

