hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/* Bitfield definition for register: MHPMEVENT4 */
/*
 * SEL (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT4_SEL_MASK (0x1F0U)
#define CSR_MHPMEVENT4_SEL_SHIFT (4U)
#define CSR_MHPMEVENT4_SEL_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT4_SEL_SHIFT) & CSR_MHPMEVENT4_SEL_MASK)
#define CSR_MHPMEVENT4_SEL_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT4_SEL_MASK) >> CSR_MHPMEVENT4_SEL_SHIFT)

/*
 * TYPE (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT4_TYPE_MASK (0xFU)
#define CSR_MHPMEVENT4_TYPE_SHIFT (0U)
#define CSR_MHPMEVENT4_TYPE_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT4_TYPE_SHIFT) & CSR_MHPMEVENT4_TYPE_MASK)
#define CSR_MHPMEVENT4_TYPE_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT4_TYPE_MASK) >> CSR_MHPMEVENT4_TYPE_SHIFT)

/* Bitfield definition for register: MHPMEVENT5 */
/*
 * SEL (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT5_SEL_MASK (0x1F0U)
#define CSR_MHPMEVENT5_SEL_SHIFT (4U)
#define CSR_MHPMEVENT5_SEL_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT5_SEL_SHIFT) & CSR_MHPMEVENT5_SEL_MASK)
#define CSR_MHPMEVENT5_SEL_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT5_SEL_MASK) >> CSR_MHPMEVENT5_SEL_SHIFT)

/*
 * TYPE (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT5_TYPE_MASK (0xFU)
#define CSR_MHPMEVENT5_TYPE_SHIFT (0U)
#define CSR_MHPMEVENT5_TYPE_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT5_TYPE_SHIFT) & CSR_MHPMEVENT5_TYPE_MASK)
#define CSR_MHPMEVENT5_TYPE_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT5_TYPE_MASK) >> CSR_MHPMEVENT5_TYPE_SHIFT)

/* Bitfield definition for register: MHPMEVENT6 */
/*
 * SEL (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT6_SEL_MASK (0x1F0U)
#define CSR_MHPMEVENT6_SEL_SHIFT (4U)
#define CSR_MHPMEVENT6_SEL_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT6_SEL_SHIFT) & CSR_MHPMEVENT6_SEL_MASK)
#define CSR_MHPMEVENT6_SEL_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT6_SEL_MASK) >> CSR_MHPMEVENT6_SEL_SHIFT)

/*
 * TYPE (RW)
 *
 * See Event Selectors table
 */
#define CSR_MHPMEVENT6_TYPE_MASK (0xFU)
#define CSR_MHPMEVENT6_TYPE_SHIFT (0U)
#define CSR_MHPMEVENT6_TYPE_SET(x) (((uint32_t)(x) << CSR_MHPMEVENT6_TYPE_SHIFT) & CSR_MHPMEVENT6_TYPE_MASK)
#define CSR_MHPMEVENT6_TYPE_GET(x) (((uint32_t)(x) & CSR_MHPMEVENT6_TYPE_MASK) >> CSR_MHPMEVENT6_TYPE_SHIFT)

/* Bitfield definition for register: MSCRATCH */
/*
 * MSCRATCH (RW)
 *
 * Scratch register storage.
 */
#define CSR_MSCRATCH_MSCRATCH_MASK (0xFFFFFFFFUL)
#define CSR_MSCRATCH_MSCRATCH_SHIFT (0U)
#define CSR_MSCRATCH_MSCRATCH_SET(x) (((uint32_t)(x) << CSR_MSCRATCH_MSCRATCH_SHIFT) & CSR_MSCRATCH_MSCRATCH_MASK)
#define CSR_MSCRATCH_MSCRATCH_GET(x) (((uint32_t)(x) & CSR_MSCRATCH_MSCRATCH_MASK) >> CSR_MSCRATCH_MSCRATCH_SHIFT)

/* Bitfield definition for register: MEPC */
/*
 * EPC (RW)
 *
 * Exception program counter.
 */
#define CSR_MEPC_EPC_MASK (0xFFFFFFFEUL)
#define CSR_MEPC_EPC_SHIFT (1U)
#define CSR_MEPC_EPC_SET(x) (((uint32_t)(x) << CSR_MEPC_EPC_SHIFT) & CSR_MEPC_EPC_MASK)
#define CSR_MEPC_EPC_GET(x) (((uint32_t)(x) & CSR_MEPC_EPC_MASK) >> CSR_MEPC_EPC_SHIFT)

/* Bitfield definition for register: MCAUSE */
/*
 * INTERRUPT (RW)
 *
 * Interrupt
 */
#define CSR_MCAUSE_INTERRUPT_MASK (0x80000000UL)
#define CSR_MCAUSE_INTERRUPT_SHIFT (31U)
#define CSR_MCAUSE_INTERRUPT_SET(x) (((uint32_t)(x) << CSR_MCAUSE_INTERRUPT_SHIFT) & CSR_MCAUSE_INTERRUPT_MASK)
#define CSR_MCAUSE_INTERRUPT_GET(x) (((uint32_t)(x) & CSR_MCAUSE_INTERRUPT_MASK) >> CSR_MCAUSE_INTERRUPT_SHIFT)

/*
 * EXCEPTION_CODE (RW)
 *
 * Exception code
 * When interrupt is 1, the value means:
 * 0:User software interrupt
 * 1:Supervisor software interrupt
 * 3:Machine software interrupt
 * 4:User timer interrupt
 * 5:Supervisor timer interrupt
 * 7:Machine timer interrupt
 * 8:User external interrupt
 * 9:Supervisor external interrupt
 * 11:Machine external interrupt
 * 16:Imprecise ECC error interrupt (slave port accesses, D-Cache evictions, and nonblocking load/stores) (M-mode)
 * 17:Bus read/write transaction error interrupt (M-mode)
 * 18:Performance monitor overflow interrupt (M-mode)
 * 256+16:Imprecise ECC error interrupt (slave port accesses, D-Cache evictions, and nonblocking load/stores) (S-mode)
 * 256+17:Bus write transaction error interrupt (S-mode)
 * 256+18:Performance monitor overflow interrupt (S-mode)
 * When interrupt bit is 0, the value means:
 * 0:Instruction address misaligned
 * 1:Instruction access fault
 * 2:Illegal instruction
 * 3:Breakpoint
 * 4:Load address misaligned
 * 5:Load access fault
 * 6:Store/AMO address misaligned
 * 7:Store/AMO access fault
 * 8:Environment call from U-mode
 * 9:Environment call from S-mode
 * 11:Environment call from M-mode
 * 32:Stack overflow exception
 * 33:Stack underflow exception
 * 40-47:Reserved
 */
#define CSR_MCAUSE_EXCEPTION_CODE_MASK (0xFFFU)
#define CSR_MCAUSE_EXCEPTION_CODE_SHIFT (0U)
#define CSR_MCAUSE_EXCEPTION_CODE_SET(x) (((uint32_t)(x) << CSR_MCAUSE_EXCEPTION_CODE_SHIFT) & CSR_MCAUSE_EXCEPTION_CODE_MASK)
#define CSR_MCAUSE_EXCEPTION_CODE_GET(x) (((uint32_t)(x) & CSR_MCAUSE_EXCEPTION_CODE_MASK) >> CSR_MCAUSE_EXCEPTION_CODE_SHIFT)

/* Bitfield definition for register: MTVAL */
/*
 * MTVAL (RW)
 *
 * Exception-specific information for software trap handling.
 */
#define CSR_MTVAL_MTVAL_MASK (0xFFFFFFFFUL)
#define CSR_MTVAL_MTVAL_SHIFT (0U)
#define CSR_MTVAL_MTVAL_SET(x) (((uint32_t)(x) << CSR_MTVAL_MTVAL_SHIFT) & CSR_MTVAL_MTVAL_MASK)
#define CSR_MTVAL_MTVAL_GET(x) (((uint32_t)(x) & CSR_MTVAL_MTVAL_MASK) >> CSR_MTVAL_MTVAL_SHIFT)

/* Bitfield definition for register: MIP */
/*
 * PMOVI (RW)
 *
 * Performance monitor overflow local interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_PMOVI_MASK (0x40000UL)
#define CSR_MIP_PMOVI_SHIFT (18U)
#define CSR_MIP_PMOVI_SET(x) (((uint32_t)(x) << CSR_MIP_PMOVI_SHIFT) & CSR_MIP_PMOVI_MASK)
#define CSR_MIP_PMOVI_GET(x) (((uint32_t)(x) & CSR_MIP_PMOVI_MASK) >> CSR_MIP_PMOVI_SHIFT)

/*
 * BWEI (RW)
 *
 * Bus read/write transaction error local interrupt pending bit. The processor may receive bus errors on load/store instructions or cache writebacks.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_BWEI_MASK (0x20000UL)
#define CSR_MIP_BWEI_SHIFT (17U)
#define CSR_MIP_BWEI_SET(x) (((uint32_t)(x) << CSR_MIP_BWEI_SHIFT) & CSR_MIP_BWEI_MASK)
#define CSR_MIP_BWEI_GET(x) (((uint32_t)(x) & CSR_MIP_BWEI_MASK) >> CSR_MIP_BWEI_SHIFT)

