hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/*
 * IMECCI (RW)
 *
 * Imprecise ECC error local interrupt enable bit. The processor may receive imprecise ECC errors on slave port accesses or cache writebacks.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_IMECCI_MASK (0x10000UL)
#define CSR_MIP_IMECCI_SHIFT (16U)
#define CSR_MIP_IMECCI_SET(x) (((uint32_t)(x) << CSR_MIP_IMECCI_SHIFT) & CSR_MIP_IMECCI_MASK)
#define CSR_MIP_IMECCI_GET(x) (((uint32_t)(x) & CSR_MIP_IMECCI_MASK) >> CSR_MIP_IMECCI_SHIFT)

/*
 * MEIP (RW)
 *
 * M mode external interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_MEIP_MASK (0x800U)
#define CSR_MIP_MEIP_SHIFT (11U)
#define CSR_MIP_MEIP_SET(x) (((uint32_t)(x) << CSR_MIP_MEIP_SHIFT) & CSR_MIP_MEIP_MASK)
#define CSR_MIP_MEIP_GET(x) (((uint32_t)(x) & CSR_MIP_MEIP_MASK) >> CSR_MIP_MEIP_SHIFT)

/*
 * SEIP (RW)
 *
 * S mode external interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_SEIP_MASK (0x200U)
#define CSR_MIP_SEIP_SHIFT (9U)
#define CSR_MIP_SEIP_SET(x) (((uint32_t)(x) << CSR_MIP_SEIP_SHIFT) & CSR_MIP_SEIP_MASK)
#define CSR_MIP_SEIP_GET(x) (((uint32_t)(x) & CSR_MIP_SEIP_MASK) >> CSR_MIP_SEIP_SHIFT)

/*
 * UEIP (RW)
 *
 * U mode external interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_UEIP_MASK (0x100U)
#define CSR_MIP_UEIP_SHIFT (8U)
#define CSR_MIP_UEIP_SET(x) (((uint32_t)(x) << CSR_MIP_UEIP_SHIFT) & CSR_MIP_UEIP_MASK)
#define CSR_MIP_UEIP_GET(x) (((uint32_t)(x) & CSR_MIP_UEIP_MASK) >> CSR_MIP_UEIP_SHIFT)

/*
 * MTIP (RW)
 *
 * M mode timer interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_MTIP_MASK (0x80U)
#define CSR_MIP_MTIP_SHIFT (7U)
#define CSR_MIP_MTIP_SET(x) (((uint32_t)(x) << CSR_MIP_MTIP_SHIFT) & CSR_MIP_MTIP_MASK)
#define CSR_MIP_MTIP_GET(x) (((uint32_t)(x) & CSR_MIP_MTIP_MASK) >> CSR_MIP_MTIP_SHIFT)

/*
 * STIP (RW)
 *
 * S mode timer interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_STIP_MASK (0x20U)
#define CSR_MIP_STIP_SHIFT (5U)
#define CSR_MIP_STIP_SET(x) (((uint32_t)(x) << CSR_MIP_STIP_SHIFT) & CSR_MIP_STIP_MASK)
#define CSR_MIP_STIP_GET(x) (((uint32_t)(x) & CSR_MIP_STIP_MASK) >> CSR_MIP_STIP_SHIFT)

/*
 * UTIP (RW)
 *
 * U mode timer interrupt pending bit
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_UTIP_MASK (0x10U)
#define CSR_MIP_UTIP_SHIFT (4U)
#define CSR_MIP_UTIP_SET(x) (((uint32_t)(x) << CSR_MIP_UTIP_SHIFT) & CSR_MIP_UTIP_MASK)
#define CSR_MIP_UTIP_GET(x) (((uint32_t)(x) & CSR_MIP_UTIP_MASK) >> CSR_MIP_UTIP_SHIFT)

/*
 * MSIP (RW)
 *
 * M mode software interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_MSIP_MASK (0x8U)
#define CSR_MIP_MSIP_SHIFT (3U)
#define CSR_MIP_MSIP_SET(x) (((uint32_t)(x) << CSR_MIP_MSIP_SHIFT) & CSR_MIP_MSIP_MASK)
#define CSR_MIP_MSIP_GET(x) (((uint32_t)(x) & CSR_MIP_MSIP_MASK) >> CSR_MIP_MSIP_SHIFT)

/*
 * SSIP (RW)
 *
 * S mode software interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_SSIP_MASK (0x2U)
#define CSR_MIP_SSIP_SHIFT (1U)
#define CSR_MIP_SSIP_SET(x) (((uint32_t)(x) << CSR_MIP_SSIP_SHIFT) & CSR_MIP_SSIP_MASK)
#define CSR_MIP_SSIP_GET(x) (((uint32_t)(x) & CSR_MIP_SSIP_MASK) >> CSR_MIP_SSIP_SHIFT)

/*
 * USIP (RW)
 *
 * U mode software interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_MIP_USIP_MASK (0x1U)
#define CSR_MIP_USIP_SHIFT (0U)
#define CSR_MIP_USIP_SET(x) (((uint32_t)(x) << CSR_MIP_USIP_SHIFT) & CSR_MIP_USIP_MASK)
#define CSR_MIP_USIP_GET(x) (((uint32_t)(x) & CSR_MIP_USIP_MASK) >> CSR_MIP_USIP_SHIFT)

/* Bitfield definition for register: PMPCFG0 */
/*
 * PMP3CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG0_PMP3CFG_MASK (0xFF000000UL)
#define CSR_PMPCFG0_PMP3CFG_SHIFT (24U)
#define CSR_PMPCFG0_PMP3CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG0_PMP3CFG_SHIFT) & CSR_PMPCFG0_PMP3CFG_MASK)
#define CSR_PMPCFG0_PMP3CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG0_PMP3CFG_MASK) >> CSR_PMPCFG0_PMP3CFG_SHIFT)

/*
 * PMP2CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG0_PMP2CFG_MASK (0xFF0000UL)
#define CSR_PMPCFG0_PMP2CFG_SHIFT (16U)
#define CSR_PMPCFG0_PMP2CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG0_PMP2CFG_SHIFT) & CSR_PMPCFG0_PMP2CFG_MASK)
#define CSR_PMPCFG0_PMP2CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG0_PMP2CFG_MASK) >> CSR_PMPCFG0_PMP2CFG_SHIFT)

/*
 * PMP1CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG0_PMP1CFG_MASK (0xFF00U)
#define CSR_PMPCFG0_PMP1CFG_SHIFT (8U)
#define CSR_PMPCFG0_PMP1CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG0_PMP1CFG_SHIFT) & CSR_PMPCFG0_PMP1CFG_MASK)
#define CSR_PMPCFG0_PMP1CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG0_PMP1CFG_MASK) >> CSR_PMPCFG0_PMP1CFG_SHIFT)

/*
 * PMP0CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG0_PMP0CFG_MASK (0xFFU)
#define CSR_PMPCFG0_PMP0CFG_SHIFT (0U)
#define CSR_PMPCFG0_PMP0CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG0_PMP0CFG_SHIFT) & CSR_PMPCFG0_PMP0CFG_MASK)
#define CSR_PMPCFG0_PMP0CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG0_PMP0CFG_MASK) >> CSR_PMPCFG0_PMP0CFG_SHIFT)

/* Bitfield definition for register: PMPCFG1 */
/*
 * PMP7CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG1_PMP7CFG_MASK (0xFF000000UL)
#define CSR_PMPCFG1_PMP7CFG_SHIFT (24U)
#define CSR_PMPCFG1_PMP7CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG1_PMP7CFG_SHIFT) & CSR_PMPCFG1_PMP7CFG_MASK)
#define CSR_PMPCFG1_PMP7CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG1_PMP7CFG_MASK) >> CSR_PMPCFG1_PMP7CFG_SHIFT)

/*
 * PMP6CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG1_PMP6CFG_MASK (0xFF0000UL)
#define CSR_PMPCFG1_PMP6CFG_SHIFT (16U)
#define CSR_PMPCFG1_PMP6CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG1_PMP6CFG_SHIFT) & CSR_PMPCFG1_PMP6CFG_MASK)
#define CSR_PMPCFG1_PMP6CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG1_PMP6CFG_MASK) >> CSR_PMPCFG1_PMP6CFG_SHIFT)

/*
 * PMP5CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG1_PMP5CFG_MASK (0xFF00U)
#define CSR_PMPCFG1_PMP5CFG_SHIFT (8U)
#define CSR_PMPCFG1_PMP5CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG1_PMP5CFG_SHIFT) & CSR_PMPCFG1_PMP5CFG_MASK)
#define CSR_PMPCFG1_PMP5CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG1_PMP5CFG_MASK) >> CSR_PMPCFG1_PMP5CFG_SHIFT)

