hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/*
 * LOAD (RW)
 *
 * Setting this field to enable this trigger to compare virtual address of a load.
 */
#define CSR_MCONTROL_LOAD_MASK (0x1U)
#define CSR_MCONTROL_LOAD_SHIFT (0U)
#define CSR_MCONTROL_LOAD_SET(x) (((uint32_t)(x) << CSR_MCONTROL_LOAD_SHIFT) & CSR_MCONTROL_LOAD_MASK)
#define CSR_MCONTROL_LOAD_GET(x) (((uint32_t)(x) & CSR_MCONTROL_LOAD_MASK) >> CSR_MCONTROL_LOAD_SHIFT)

/* Bitfield definition for register: ICOUNT */
/*
 * TYPE (RW)
 *
 * The selected trigger is an instruction count trigger.
 */
#define CSR_ICOUNT_TYPE_MASK (0xF0000000UL)
#define CSR_ICOUNT_TYPE_SHIFT (28U)
#define CSR_ICOUNT_TYPE_SET(x) (((uint32_t)(x) << CSR_ICOUNT_TYPE_SHIFT) & CSR_ICOUNT_TYPE_MASK)
#define CSR_ICOUNT_TYPE_GET(x) (((uint32_t)(x) & CSR_ICOUNT_TYPE_MASK) >> CSR_ICOUNT_TYPE_SHIFT)

/*
 * DMODE (RW)
 *
 * Setting this field to indicate the trigger is used by Debug Mode.
 * 0:Both Debug-mode and M-mode can write the currently selected trigger registers.
 * 1:Only Debug Mode can write the currently selected trigger registers. Writes from M-mode is ignored.
 */
#define CSR_ICOUNT_DMODE_MASK (0x8000000UL)
#define CSR_ICOUNT_DMODE_SHIFT (27U)
#define CSR_ICOUNT_DMODE_SET(x) (((uint32_t)(x) << CSR_ICOUNT_DMODE_SHIFT) & CSR_ICOUNT_DMODE_MASK)
#define CSR_ICOUNT_DMODE_GET(x) (((uint32_t)(x) & CSR_ICOUNT_DMODE_MASK) >> CSR_ICOUNT_DMODE_SHIFT)

/*
 * COUNT (RO)
 *
 * This field is hardwired to 1 for single-stepping support
 */
#define CSR_ICOUNT_COUNT_MASK (0x400U)
#define CSR_ICOUNT_COUNT_SHIFT (10U)
#define CSR_ICOUNT_COUNT_GET(x) (((uint32_t)(x) & CSR_ICOUNT_COUNT_MASK) >> CSR_ICOUNT_COUNT_SHIFT)

/*
 * M (RW)
 *
 * Setting this field to enable this trigger in M-mode.
 */
#define CSR_ICOUNT_M_MASK (0x200U)
#define CSR_ICOUNT_M_SHIFT (9U)
#define CSR_ICOUNT_M_SET(x) (((uint32_t)(x) << CSR_ICOUNT_M_SHIFT) & CSR_ICOUNT_M_MASK)
#define CSR_ICOUNT_M_GET(x) (((uint32_t)(x) & CSR_ICOUNT_M_MASK) >> CSR_ICOUNT_M_SHIFT)

/*
 * S (RW)
 *
 * Setting this field to enable this trigger in S-mode.
 */
#define CSR_ICOUNT_S_MASK (0x80U)
#define CSR_ICOUNT_S_SHIFT (7U)
#define CSR_ICOUNT_S_SET(x) (((uint32_t)(x) << CSR_ICOUNT_S_SHIFT) & CSR_ICOUNT_S_MASK)
#define CSR_ICOUNT_S_GET(x) (((uint32_t)(x) & CSR_ICOUNT_S_MASK) >> CSR_ICOUNT_S_SHIFT)

/*
 * U (RW)
 *
 * Setting this field to enable this trigger in U-mode.
 */
#define CSR_ICOUNT_U_MASK (0x40U)
#define CSR_ICOUNT_U_SHIFT (6U)
#define CSR_ICOUNT_U_SET(x) (((uint32_t)(x) << CSR_ICOUNT_U_SHIFT) & CSR_ICOUNT_U_MASK)
#define CSR_ICOUNT_U_GET(x) (((uint32_t)(x) & CSR_ICOUNT_U_MASK) >> CSR_ICOUNT_U_SHIFT)

/*
 * ACTION (RW)
 *
 * Setting this field to select what happens when this trigger matches.
 * 0:Raise a breakpoint exception
 * 1:Enter Debug Mode. (Only supported when DMODE is 1.)
 */
#define CSR_ICOUNT_ACTION_MASK (0x3FU)
#define CSR_ICOUNT_ACTION_SHIFT (0U)
#define CSR_ICOUNT_ACTION_SET(x) (((uint32_t)(x) << CSR_ICOUNT_ACTION_SHIFT) & CSR_ICOUNT_ACTION_MASK)
#define CSR_ICOUNT_ACTION_GET(x) (((uint32_t)(x) & CSR_ICOUNT_ACTION_MASK) >> CSR_ICOUNT_ACTION_SHIFT)

/* Bitfield definition for register: ITRIGGER */
/*
 * TYPE (RW)
 *
 * The selected trigger is an interrupt trigger.
 */
#define CSR_ITRIGGER_TYPE_MASK (0xF0000000UL)
#define CSR_ITRIGGER_TYPE_SHIFT (28U)
#define CSR_ITRIGGER_TYPE_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_TYPE_SHIFT) & CSR_ITRIGGER_TYPE_MASK)
#define CSR_ITRIGGER_TYPE_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_TYPE_MASK) >> CSR_ITRIGGER_TYPE_SHIFT)

/*
 * DMODE (RW)
 *
 * Setting this field to indicate the trigger is used by Debug Mode.
 * 0:Both Debug-mode and M-mode can write the currently selected trigger registers.
 * 1:Only Debug Mode can write the currently selected trigger registers. Writes from M-mode is ignored.
 */
#define CSR_ITRIGGER_DMODE_MASK (0x8000000UL)
#define CSR_ITRIGGER_DMODE_SHIFT (27U)
#define CSR_ITRIGGER_DMODE_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_DMODE_SHIFT) & CSR_ITRIGGER_DMODE_MASK)
#define CSR_ITRIGGER_DMODE_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_DMODE_MASK) >> CSR_ITRIGGER_DMODE_SHIFT)

/*
 * M (RW)
 *
 * Setting this field to enable this trigger in M-mode.
 */
#define CSR_ITRIGGER_M_MASK (0x200U)
#define CSR_ITRIGGER_M_SHIFT (9U)
#define CSR_ITRIGGER_M_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_M_SHIFT) & CSR_ITRIGGER_M_MASK)
#define CSR_ITRIGGER_M_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_M_MASK) >> CSR_ITRIGGER_M_SHIFT)

/*
 * S (RW)
 *
 * Setting this field to enable this trigger in S-mode.
 */
#define CSR_ITRIGGER_S_MASK (0x80U)
#define CSR_ITRIGGER_S_SHIFT (7U)
#define CSR_ITRIGGER_S_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_S_SHIFT) & CSR_ITRIGGER_S_MASK)
#define CSR_ITRIGGER_S_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_S_MASK) >> CSR_ITRIGGER_S_SHIFT)

/*
 * U (RW)
 *
 * Setting this field to enable this trigger in U-mode.
 */
#define CSR_ITRIGGER_U_MASK (0x40U)
#define CSR_ITRIGGER_U_SHIFT (6U)
#define CSR_ITRIGGER_U_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_U_SHIFT) & CSR_ITRIGGER_U_MASK)
#define CSR_ITRIGGER_U_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_U_MASK) >> CSR_ITRIGGER_U_SHIFT)

/*
 * ACTION (RW)
 *
 * Setting this field to select what happens when this trigger matches.
 * 0:Raise a breakpoint exception.
 * 1:Enter Debug Mode. (Only supported when DMODE is 1.)
 */
#define CSR_ITRIGGER_ACTION_MASK (0x3FU)
#define CSR_ITRIGGER_ACTION_SHIFT (0U)
#define CSR_ITRIGGER_ACTION_SET(x) (((uint32_t)(x) << CSR_ITRIGGER_ACTION_SHIFT) & CSR_ITRIGGER_ACTION_MASK)
#define CSR_ITRIGGER_ACTION_GET(x) (((uint32_t)(x) & CSR_ITRIGGER_ACTION_MASK) >> CSR_ITRIGGER_ACTION_SHIFT)

/* Bitfield definition for register: ETRIGGER */
/*
 * TYPE (RW)
 *
 * The selected trigger is an exception trigger.
 */
#define CSR_ETRIGGER_TYPE_MASK (0xF0000000UL)
#define CSR_ETRIGGER_TYPE_SHIFT (28U)
#define CSR_ETRIGGER_TYPE_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_TYPE_SHIFT) & CSR_ETRIGGER_TYPE_MASK)
#define CSR_ETRIGGER_TYPE_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_TYPE_MASK) >> CSR_ETRIGGER_TYPE_SHIFT)

/*
 * DMODE (RW)
 *
 * Setting this field to indicate the trigger is used by Debug Mode.
 * 0:Both Debug-mode and M-mode can write the currently selected trigger registers.
 * 1:Only Debug Mode can write the currently selected trigger registers. Writes from M-mode is ignored.
 */
#define CSR_ETRIGGER_DMODE_MASK (0x8000000UL)
#define CSR_ETRIGGER_DMODE_SHIFT (27U)
#define CSR_ETRIGGER_DMODE_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_DMODE_SHIFT) & CSR_ETRIGGER_DMODE_MASK)
#define CSR_ETRIGGER_DMODE_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_DMODE_MASK) >> CSR_ETRIGGER_DMODE_SHIFT)

