hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/*
 * NMI (RW)
 *
 * Setting this field to enable this trigger in non-maskable interrupts, regardless of the values of s, u, and m.
 */
#define CSR_ETRIGGER_NMI_MASK (0x400U)
#define CSR_ETRIGGER_NMI_SHIFT (10U)
#define CSR_ETRIGGER_NMI_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_NMI_SHIFT) & CSR_ETRIGGER_NMI_MASK)
#define CSR_ETRIGGER_NMI_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_NMI_MASK) >> CSR_ETRIGGER_NMI_SHIFT)

/*
 * M (RW)
 *
 * Setting this field to enable this trigger in M-mode.
 */
#define CSR_ETRIGGER_M_MASK (0x200U)
#define CSR_ETRIGGER_M_SHIFT (9U)
#define CSR_ETRIGGER_M_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_M_SHIFT) & CSR_ETRIGGER_M_MASK)
#define CSR_ETRIGGER_M_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_M_MASK) >> CSR_ETRIGGER_M_SHIFT)

/*
 * S (RW)
 *
 * Setting this field to enable this trigger in S-mode.
 */
#define CSR_ETRIGGER_S_MASK (0x80U)
#define CSR_ETRIGGER_S_SHIFT (7U)
#define CSR_ETRIGGER_S_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_S_SHIFT) & CSR_ETRIGGER_S_MASK)
#define CSR_ETRIGGER_S_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_S_MASK) >> CSR_ETRIGGER_S_SHIFT)

/*
 * U (RW)
 *
 * Setting this field to enable this trigger in U-mode.
 */
#define CSR_ETRIGGER_U_MASK (0x40U)
#define CSR_ETRIGGER_U_SHIFT (6U)
#define CSR_ETRIGGER_U_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_U_SHIFT) & CSR_ETRIGGER_U_MASK)
#define CSR_ETRIGGER_U_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_U_MASK) >> CSR_ETRIGGER_U_SHIFT)

/*
 * ACTION (RW)
 *
 * Setting this field to select what happens when this trigger matches.
 * 0:Raise a breakpoint exception
 * 1:Enter Debug Mode. (Only supported when DMODE is 1.)
 */
#define CSR_ETRIGGER_ACTION_MASK (0x3FU)
#define CSR_ETRIGGER_ACTION_SHIFT (0U)
#define CSR_ETRIGGER_ACTION_SET(x) (((uint32_t)(x) << CSR_ETRIGGER_ACTION_SHIFT) & CSR_ETRIGGER_ACTION_MASK)
#define CSR_ETRIGGER_ACTION_GET(x) (((uint32_t)(x) & CSR_ETRIGGER_ACTION_MASK) >> CSR_ETRIGGER_ACTION_SHIFT)

/* Bitfield definition for register: TDATA2 */
/*
 * DATA (RW)
 *
 * This register provides accesses to the tdata2 register of the currently selected trigger registers selected by the tselect register, and it holds trigger-specific data..
 */
#define CSR_TDATA2_DATA_MASK (0xFFFFFFFFUL)
#define CSR_TDATA2_DATA_SHIFT (0U)
#define CSR_TDATA2_DATA_SET(x) (((uint32_t)(x) << CSR_TDATA2_DATA_SHIFT) & CSR_TDATA2_DATA_MASK)
#define CSR_TDATA2_DATA_GET(x) (((uint32_t)(x) & CSR_TDATA2_DATA_MASK) >> CSR_TDATA2_DATA_SHIFT)

/* Bitfield definition for register: TDATA3 */
/*
 * DATA (RW)
 *
 * This register provides accesses to the tdata3 register of the currently selected trigger registers selected by the tselect register, and it holds trigger-specific data..
 */
#define CSR_TDATA3_DATA_MASK (0xFFFFFFFFUL)
#define CSR_TDATA3_DATA_SHIFT (0U)
#define CSR_TDATA3_DATA_SET(x) (((uint32_t)(x) << CSR_TDATA3_DATA_SHIFT) & CSR_TDATA3_DATA_MASK)
#define CSR_TDATA3_DATA_GET(x) (((uint32_t)(x) & CSR_TDATA3_DATA_MASK) >> CSR_TDATA3_DATA_SHIFT)

/* Bitfield definition for register: TEXTRA */
/*
 * MVALUE (RW)
 *
 * Data used together with MSELECT.
 */
#define CSR_TEXTRA_MVALUE_MASK (0xFC000000UL)
#define CSR_TEXTRA_MVALUE_SHIFT (26U)
#define CSR_TEXTRA_MVALUE_SET(x) (((uint32_t)(x) << CSR_TEXTRA_MVALUE_SHIFT) & CSR_TEXTRA_MVALUE_MASK)
#define CSR_TEXTRA_MVALUE_GET(x) (((uint32_t)(x) & CSR_TEXTRA_MVALUE_MASK) >> CSR_TEXTRA_MVALUE_SHIFT)

/*
 * MSELECT (RW)
 *
 * 0:Ignore MVALUE.
 * 1:This trigger will only match if the lower bits of mcontext equal MVALUE.
 */
#define CSR_TEXTRA_MSELECT_MASK (0x2000000UL)
#define CSR_TEXTRA_MSELECT_SHIFT (25U)
#define CSR_TEXTRA_MSELECT_SET(x) (((uint32_t)(x) << CSR_TEXTRA_MSELECT_SHIFT) & CSR_TEXTRA_MSELECT_MASK)
#define CSR_TEXTRA_MSELECT_GET(x) (((uint32_t)(x) & CSR_TEXTRA_MSELECT_MASK) >> CSR_TEXTRA_MSELECT_SHIFT)

/*
 * SVALUE (RW)
 *
 * Data used together with SSELECT.
 */
#define CSR_TEXTRA_SVALUE_MASK (0x7FCU)
#define CSR_TEXTRA_SVALUE_SHIFT (2U)
#define CSR_TEXTRA_SVALUE_SET(x) (((uint32_t)(x) << CSR_TEXTRA_SVALUE_SHIFT) & CSR_TEXTRA_SVALUE_MASK)
#define CSR_TEXTRA_SVALUE_GET(x) (((uint32_t)(x) & CSR_TEXTRA_SVALUE_MASK) >> CSR_TEXTRA_SVALUE_SHIFT)

/*
 * SSELECT (RW)
 *
 * 0:Ignore MVALUE
 * 1:This trigger will only match if the lower bits of scontext equal SVALUE
 * 2This trigger will only match if satp.ASID equals SVALUE.
 */
#define CSR_TEXTRA_SSELECT_MASK (0x3U)
#define CSR_TEXTRA_SSELECT_SHIFT (0U)
#define CSR_TEXTRA_SSELECT_SET(x) (((uint32_t)(x) << CSR_TEXTRA_SSELECT_SHIFT) & CSR_TEXTRA_SSELECT_MASK)
#define CSR_TEXTRA_SSELECT_GET(x) (((uint32_t)(x) & CSR_TEXTRA_SSELECT_MASK) >> CSR_TEXTRA_SSELECT_SHIFT)

/* Bitfield definition for register: TINFO */
/*
 * INFO (RO)
 *
 * One bit for each possible type in tdata1. Bit N corresponds to type N. If the bit is set, then that
 * type is supported by the currently selected trigger. If the currently selected trigger does not exist, this field contains 1.
 * 0:When this bit is set, there is no trigger at this tselect
 * 1:Reserved and hardwired to 0.
 * 2：When this bit is set, the selected trigger supports type of address/data match trigger
 * 3:When this bit is set, the selected trigger supports type of instruction count trigger.
 * 4:When this bit is set, the selected trigger supports type of interrupt trigger
 * 5:When this bit is set, the selected trigger supports type of exception trigger
 * 15:When this bit is set, the selected trigger exists (so enumeration shouldn’t terminate), but is not currently available.
 * Others:Reserved for future use.
 */
#define CSR_TINFO_INFO_MASK (0xFFFFU)
#define CSR_TINFO_INFO_SHIFT (0U)
#define CSR_TINFO_INFO_GET(x) (((uint32_t)(x) & CSR_TINFO_INFO_MASK) >> CSR_TINFO_INFO_SHIFT)

/* Bitfield definition for register: TCONTROL */
/*
 * MPTE (RW)
 *
 * M-mode previous trigger enable field. When a trap into M-mode is taken, MPTE is set to the value of MTE.
 */
#define CSR_TCONTROL_MPTE_MASK (0x80U)
#define CSR_TCONTROL_MPTE_SHIFT (7U)
#define CSR_TCONTROL_MPTE_SET(x) (((uint32_t)(x) << CSR_TCONTROL_MPTE_SHIFT) & CSR_TCONTROL_MPTE_MASK)
#define CSR_TCONTROL_MPTE_GET(x) (((uint32_t)(x) & CSR_TCONTROL_MPTE_MASK) >> CSR_TCONTROL_MPTE_SHIFT)

