hpmicro/hpm_sdk/soc/HPM6E00/HPM6E80/hpm_csr_regs.h
/*
 * IC_ECC (RO)
 *
 * Cache soft-error protection scheme
 * 0:No parity/ECC
 * 1:Parity
 * 2:ECC
 * 3:Reserved
 * When instruction cache is not configured, this field should be ignored.
 */
#define CSR_MICM_CFG_IC_ECC_MASK (0xC00U)
#define CSR_MICM_CFG_IC_ECC_SHIFT (10U)
#define CSR_MICM_CFG_IC_ECC_GET(x) (((uint32_t)(x) & CSR_MICM_CFG_IC_ECC_MASK) >> CSR_MICM_CFG_IC_ECC_SHIFT)

/*
 * ILCK (RO)
 *
 * I-Cache locking support
 * 0:No locking support
 * 1:With locking support
 * When instruction cache is not configured, this field should be ignored.
 */
#define CSR_MICM_CFG_ILCK_MASK (0x200U)
#define CSR_MICM_CFG_ILCK_SHIFT (9U)
#define CSR_MICM_CFG_ILCK_GET(x) (((uint32_t)(x) & CSR_MICM_CFG_ILCK_MASK) >> CSR_MICM_CFG_ILCK_SHIFT)

/*
 * ISZ (RO)
 *
 * Cache block (line) size
 * 0:No I-Cache
 * 1:8 bytes
 * 2:16 bytes
 * 3:32 bytes
 * 4:64 bytes
 * 5:128 bytes
 * 6-7:Reserved
 * When instruction cache is not configured, this field should be ignored.
 */
#define CSR_MICM_CFG_ISZ_MASK (0x1C0U)
#define CSR_MICM_CFG_ISZ_SHIFT (6U)
#define CSR_MICM_CFG_ISZ_GET(x) (((uint32_t)(x) & CSR_MICM_CFG_ISZ_MASK) >> CSR_MICM_CFG_ISZ_SHIFT)

/*
 * IWAY (RO)
 *
 * Associativity of I-Cache
 * 0:Direct-mapped
 * 1:2-way
 * 2:3-way
 * 3:4-way
 * 4:5-way
 * 5:6-way
 * 6:7-way
 * 7:8-way
 * When instruction cache is not configured, this field should be ignored.
 */
#define CSR_MICM_CFG_IWAY_MASK (0x38U)
#define CSR_MICM_CFG_IWAY_SHIFT (3U)
#define CSR_MICM_CFG_IWAY_GET(x) (((uint32_t)(x) & CSR_MICM_CFG_IWAY_MASK) >> CSR_MICM_CFG_IWAY_SHIFT)

/*
 * ISET (RO)
 *
 * I-Cache sets (# of cache lines per way):
 * When micm_cfg.SETH==0:
 * 0:64
 * 1:128
 * 2:256
 * 3:512
 * 4:1024
 * 5:2048
 * 6:4096
 * 7:Reserved
 * When micm_cfg.SETH==1:
 * 0:32
 * 1:16
 * 2:8
 * 3-7:Reserved
 */
#define CSR_MICM_CFG_ISET_MASK (0x7U)
#define CSR_MICM_CFG_ISET_SHIFT (0U)
#define CSR_MICM_CFG_ISET_GET(x) (((uint32_t)(x) & CSR_MICM_CFG_ISET_MASK) >> CSR_MICM_CFG_ISET_SHIFT)

/* Bitfield definition for register: MDCM_CFG */
/*
 * SETH (RO)
 *
 * This bit extends the DSET field.
 * When data cache is not configured, this field should be ignored
 */
#define CSR_MDCM_CFG_SETH_MASK (0x1000000UL)
#define CSR_MDCM_CFG_SETH_SHIFT (24U)
#define CSR_MDCM_CFG_SETH_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_SETH_MASK) >> CSR_MDCM_CFG_SETH_SHIFT)

/*
 * DLM_ECC (RO)
 *
 * DLM soft-error protection scheme
 * 0:No parity/ECC
 * 1:Parity
 * 2:ECC
 * 3:Reserved
 * When DLM is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DLM_ECC_MASK (0x600000UL)
#define CSR_MDCM_CFG_DLM_ECC_SHIFT (21U)
#define CSR_MDCM_CFG_DLM_ECC_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DLM_ECC_MASK) >> CSR_MDCM_CFG_DLM_ECC_SHIFT)

/*
 * DLMSZ (RO)
 *
 * DLM Size
 * 0:0 Byte
 * 1:1 KiB
 * 2:2 KiB
 * 3:4 KiB
 * 4:8 KiB
 * 5:16 KiB
 * 6:32 KiB
 * 7:64 KiB
 * 8:128 KiB
 * 9:256 KiB
 * 10:512 KiB
 * 11:1 MiB
 * 12:2 MiB
 * 13:4 MiB
 * 14:8 MiB
 * 15:16 MiB
 * 16-31:Reserved
 * When ILM is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DLMSZ_MASK (0xF8000UL)
#define CSR_MDCM_CFG_DLMSZ_SHIFT (15U)
#define CSR_MDCM_CFG_DLMSZ_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DLMSZ_MASK) >> CSR_MDCM_CFG_DLMSZ_SHIFT)

/*
 * DLMB (RO)
 *
 * Number of DLM base registers present
 * 0:No DLM base register present
 * 1:One DLM base register present
 * 2-7:Reserved
 * When DLM is not configured, this field should be ignored
 */
#define CSR_MDCM_CFG_DLMB_MASK (0x7000U)
#define CSR_MDCM_CFG_DLMB_SHIFT (12U)
#define CSR_MDCM_CFG_DLMB_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DLMB_MASK) >> CSR_MDCM_CFG_DLMB_SHIFT)

/*
 * DC_ECC (RO)
 *
 * Cache soft-error protection scheme
 * 0:No parity/ECC support
 * 1:Has parity support
 * 2:Has ECC support
 * 3:Reserved
 * When data cache is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DC_ECC_MASK (0xC00U)
#define CSR_MDCM_CFG_DC_ECC_SHIFT (10U)
#define CSR_MDCM_CFG_DC_ECC_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DC_ECC_MASK) >> CSR_MDCM_CFG_DC_ECC_SHIFT)

/*
 * DLCK (RO)
 *
 * D-Cache locking support
 * 0:No locking support
 * 1:With locking support
 * When data cache is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DLCK_MASK (0x200U)
#define CSR_MDCM_CFG_DLCK_SHIFT (9U)
#define CSR_MDCM_CFG_DLCK_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DLCK_MASK) >> CSR_MDCM_CFG_DLCK_SHIFT)

/*
 * DSZ (RO)
 *
 * Cache block (line) size
 * 0:No I-Cache
 * 1:8 bytes
 * 2:16 bytes
 * 3:32 bytes
 * 4:64 bytes
 * 5:128 bytes
 * 6-7:Reserved
 * When instruction cache is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DSZ_MASK (0x1C0U)
#define CSR_MDCM_CFG_DSZ_SHIFT (6U)
#define CSR_MDCM_CFG_DSZ_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DSZ_MASK) >> CSR_MDCM_CFG_DSZ_SHIFT)

/*
 * DWAY (RO)
 *
 * Associativity of D-Cache
 * 0:Direct-mapped
 * 1:2-way
 * 2:3-way
 * 3:4-way
 * 4:5-way
 * 5:6-way
 * 6:7-way
 * 7:8-way
 * When data cache is not configured, this field should be ignored.
 */
#define CSR_MDCM_CFG_DWAY_MASK (0x38U)
#define CSR_MDCM_CFG_DWAY_SHIFT (3U)
#define CSR_MDCM_CFG_DWAY_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DWAY_MASK) >> CSR_MDCM_CFG_DWAY_SHIFT)

/*
 * DSET (RO)
 *
 * D-Cache sets (# of cache lines per way):
 * When mdcm_cfg.SETH==0:
 * 0:64
 * 1:128
 * 2:256
 * 3:512
 * 4:1024
 * 5:2048
 * 6:4096
 * 7:Reserved
 * When mdcm_cfg.SETH==1:
 * 0:32
 * 1:16
 * 2:8
 * 3-7:Reserved
 * When data cache is not configured, this field should be ignored
 */
#define CSR_MDCM_CFG_DSET_MASK (0x7U)
#define CSR_MDCM_CFG_DSET_SHIFT (0U)
#define CSR_MDCM_CFG_DSET_GET(x) (((uint32_t)(x) & CSR_MDCM_CFG_DSET_MASK) >> CSR_MDCM_CFG_DSET_SHIFT)

/* Bitfield definition for register: MMSC_CFG */
/*
 * MSC_EXT (RO)
 *
 * Indicates if the mmsc_cfg2 CSR is present or not.
 * 0:The mmsc_cfg2 CSR is not present.
 * 1:The mmsc_cfg2 CSR is present
 */
#define CSR_MMSC_CFG_MSC_EXT_MASK (0x80000000UL)
#define CSR_MMSC_CFG_MSC_EXT_SHIFT (31U)
#define CSR_MMSC_CFG_MSC_EXT_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_MSC_EXT_MASK) >> CSR_MMSC_CFG_MSC_EXT_SHIFT)

